using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace LinqToSqlTest
{
	class CreateTestData
	{
		static string basedir = System.Environment.GetFolderPath(Environment.SpecialFolder.MyDocuments) + "\\";
		static string ConnectionString = "Data Source=.\\SQLEXPRESS;AttachDbFilename=\"" + basedir + "My\\Comic0.mdf\";Integrated Security=True;User Instance=True";

		public static void Create()
		{
			string data = @"
魔法先生ネギま！,20,赤松健,講談社,420,2007-10-17
ネギま！パーティーＢｏｏｋ ネギパ！,15,赤松健,講談社,500,2007-10-17
ネギま！パーティーＢｏｏｋ ネギパ！,14,赤松健,講談社,500,2007-09-14
ネギま！パーティーＢｏｏｋ ネギパ！,13,赤松健,講談社,500,2007-08-17
ネギま！パーティーＢｏｏｋ ネギパ！,12,赤松健,講談社,500,2007-07-17
魔法先生ネギま！,19,赤松健,講談社,420,2007-07-17
ネギま！パーティーＢｏｏｋ ネギパ！,11,赤松健,講談社,500,2007-06-15
ネギま！パーティーＢｏｏｋ ネギパ！,10,赤松健,講談社,500,2007-05-17
ネギま！パーティーＢｏｏｋ ネギパ！,9,赤松健,講談社,500,2007-04-17
魔法先生ネギま！,18,赤松健,講談社,420,2007-04-17
ネギま！パーティーＢｏｏｋ ネギパ！,8,赤松健,講談社,500,2007-03-16
ネギま！パーティーＢｏｏｋ ネギパ！,7,赤松健,講談社,500,2007-02-16
ネギま！パーティーＢｏｏｋ ネギパ！,6,赤松健,講談社,500,2007-01-17
魔法先生ネギま！,17,赤松健,講談社,420,2007-01-17
ネギま！パーティーＢｏｏｋ ネギパ！,5,赤松健,講談社,500,2006-12-15
ネギま！パーティーＢｏｏｋ ネギパ！,4,赤松健,講談社,500,2006-11-17
魔法先生ネギま！,16,赤松健,講談社,420,2006-10-17
ネギま！パーティーＢｏｏｋ ネギパ！,3,赤松健,講談社,500,2006-10-17
ネギま！パーティーＢｏｏｋ ネギパ！,2,赤松健,講談社,500,2006-09-15
魔法先生ネギま！,15,赤松健,講談社,420,2006-08-17
ネギま！パーティーＢｏｏｋ ネギパ！,1,赤松健,講談社,500,2006-08-17
魔法先生ネギま！,14,赤松健,講談社,420,2006-04-17
魔法先生ネギま！,13,赤松健,講談社,410,2006-01-17
魔法先生ネギま！,12,赤松健,講談社,410,2005-10-17
魔法先生ネギま！,11,赤松健,講談社,410,2005-08-17
魔法先生ネギま！,10,赤松健,講談社,420,2005-05-17
魔法先生ネギま！,9,赤松健,講談社,420,2005-02-17
魔法先生ネギま！,8,赤松健,講談社,420,2004-11-17
魔法先生ネギま！,7,赤松健,講談社,420,2004-09-17
魔法先生ネギま！,6,赤松健,講談社,420,2004-06-17
魔法先生ネギま！,5,赤松健,講談社,420,2004-04-16
魔法先生ネギま！,4,赤松健,講談社,420,2004-01-16
魔法先生ネギま！,3,赤松健,講談社,420,2003-11-17
魔法先生ネギま！,2,赤松健,講談社,410,2003-08-12
魔法先生ネギま！,1,赤松健,講談社,420,2003-07-17
ラブひな∞,,赤松健,講談社,900,2002-07
ラブひな,14,赤松健,講談社,410,2002-01
ラブひな,13,赤松健,講談社,410,2001-10
ラブひな,12,赤松健,講談社,410,2001-07
ラブひな,11,赤松健,講談社,410,2001-04
ラブひな,10,赤松健,講談社,410,2001-01
ラブひな,9,赤松健,講談社,410,2000-10
ラブひな0,,赤松健,講談社,900,2000-07
ラブひな,8,赤松健,講談社,410,2000-07
ラブひな,7,赤松健,講談社,410,2000-04
ラブひな,6,赤松健,講談社,410,2000-02
ラブひな,5,赤松健,講談社,410,1999-11
ラブひな,4,赤松健,講談社,410,1999-09
ラブひな,3,赤松健,講談社,410,1999-06
ラブひな,2,赤松健,講談社,410,1999-04
ラブひな,1,赤松健,講談社,410,1999-03
A・Iが止まらない,9,赤松健,講談社,410,1997-10
A・Iが止まらない,8,赤松健,講談社,410,1997-05
A・Iが止まらない,7,赤松健,講談社,407,1997-02
A・Iが止まらない,6,赤松健,講談社,407,1996-07
A・Iが止まらない,5,赤松健,講談社,407,1996-03
A・Iが止まらない,4,赤松健,講談社,407,1995-07
A・Iが止まらない,3,赤松健,講談社,407,1995-03
A・Iが止まらない,2,赤松健,講談社,407,1994-11
A・Iが止まらない,1,赤松健,講談社,407,1994-09
さよなら絶望先生,10,久米田康治,講談社,420,2007-09-14
さよなら絶望先生,9,久米田康治,講談社,420,2007-07-17
さよなら絶望先生,8,久米田康治,講談社,420,2007-04-17
さよなら絶望先生,7,久米田康治,講談社,420,2007-02-16
さよなら絶望先生,6,久米田康治,講談社,420,2006-12-15
さよなら絶望先生,5,久米田康治,講談社,420,2006-09-15
さよなら絶望先生,4,久米田康治,講談社,420,2006-06-16
さよなら絶望先生,3,久米田康治,講談社,420,2006-03-17
さよなら絶望先生,2,久米田康治,講談社,420,2005-12-16
さよなら絶望先生,1,久米田康治,講談社,420,2005-09-16
かってに改蔵,26,久米田康治,小学館,410,2004-09-17
かってに改蔵,25,久米田康治,小学館,410,2004-06-18
かってに改蔵,24,久米田康治,小学館,410,2004-03-18
かってに改蔵,23,久米田康治,小学館,410,2003-12-18
かってに改蔵,22,久米田康治,小学館,410,2003-09-18
かってに改蔵,21,久米田康治,小学館,410,2003-06-18
かってに改蔵,20,久米田康治,小学館,410,2003-03-18
かってに改蔵,19,久米田康治,小学館,410,2003-01-18
かってに改蔵,18,久米田康治,小学館,410,2002-11-18
かってに改蔵,17,久米田康治,小学館,410,2002-08-09
育ってダーリン！！,2,久米田康治,小学館,500,2002-06-18
かってに改蔵,16,久米田康治,小学館,410,2002-05-18
育ってダーリン！！,1,久米田康治,小学館,500,2002-04
かってに改蔵,15,久米田康治,小学館,410,2002-03-18
かってに改蔵,14,久米田康治,小学館,410,2001-12
かってに改蔵,13,久米田康治,小学館,410,2001-09
かってに改蔵,12,久米田康治,小学館,410,2001-06
かってに改蔵,11,久米田康治,小学館,410,2001-03
かってに改蔵,10,久米田康治,小学館,410,2000-12
かってに改蔵,9,久米田康治,小学館,410,2000-10
かってに改蔵,8,久米田康治,小学館,410,2000-08
かってに改蔵,7,久米田康治,小学館,410,2000-05
かってに改蔵,6,久米田康治,小学館,410,2000-02
かってに改蔵,5,久米田康治,小学館,410,1999-11
かってに改蔵,4,久米田康治,小学館,410,1999-08
かってに改蔵,3,久米田康治,小学館,410,1999-06
かってに改蔵,2,久米田康治,小学館,410,1999-04
かってに改蔵,1,久米田康治,小学館,410,1999-02
太陽の戦士ポカポカ,5,久米田康治,小学館,410,1997-11
太陽の戦士ポカポカ,4,久米田康治,小学館,410,1997-10
太陽の戦士ポカポカ,3,久米田康治,小学館,410,1997-08
太陽の戦士ポカポカ,2,久米田康治,小学館,410,1997-04
太陽の戦士ポカポカ,1,久米田康治,小学館,407,1997-02
行け！！南国アイスホッケー部,23,久米田康治,小学館,407,1996-12
行け！！南国アイスホッケー部,22,久米田康治,小学館,407,1996-11
行け！！南国アイスホッケー部,21,久米田康治,小学館,407,1996-09
行け！！南国アイスホッケー部,20,久米田康治,小学館,407,1996-07
行け！！南国アイスホッケー部,19,久米田康治,小学館,407,1996-04
行け！！南国アイスホッケー部,18,久米田康治,小学館,407,1995-12
行け！！南国アイスホッケー部,17,久米田康治,小学館,407,1995-08
行け！！南国アイスホッケー部,16,久米田康治,小学館,398,1995-04
行け！！南国アイスホッケー部,15,久米田康治,小学館,398,1995-01
行け！！南国アイスホッケー部,14,久米田康治,小学館,398,1994-10
ルートパラダイス,2,久米田康治,小学館,509,1994-08
行け！！南国アイスホッケー部,13,久米田康治,小学館,398,1994-07
行け！！南国アイスホッケー部,12,久米田康治,小学館,398,1994-04
ルートパラダイス,1,久米田康治,小学館,509,1994-01
行け！！南国アイスホッケー部,11,久米田康治,小学館,398,1994-01
行け！！南国アイスホッケー部,10,久米田康治,小学館,398,1993-11
行け！！南国アイスホッケー部,9,久米田康治,小学館,398,1993-08
行け！！南国アイスホッケー部,8,久米田康治,小学館,398,1993-06
行け！！南国アイスホッケー部,7,久米田康治,小学館,398,1993-03
行け！！南国アイスホッケー部,6,久米田康治,小学館,398,1993-01
行け！！南国アイスホッケー部,5,久米田康治,小学館,398,1992-10
行け！！南国アイスホッケー部,4,久米田康治,小学館,398,1992-08
行け！！南国アイスホッケー部,3,久米田康治,小学館,398,1992-06
行け！！南国アイスホッケー部,2,久米田康治,小学館,398,1992-05
行け！！南国アイスホッケー部,1,久米田康治,小学館,398,1992-02
アニメ店長,3,島本和彦,一迅社,580,2007-09-25
新吼えろペン,8,島本和彦,小学館,560,2007-08-17
新吼えろペン,7,島本和彦,小学館,560,2007-04-19
新吼えろペン,6,島本和彦,小学館,560,2007-01-19
ガレキの翔,,島本和彦,フォックス出版,680,2006-10
あしたのジョーの方程式,,島本和彦,太田出版,1365,2006-09-14
新吼えろペン,5,島本和彦,小学館,560,2006-07-19
新吼えろペン,4,島本和彦,小学館,560,2006-04
新吼えろペン,3,島本和彦,小学館,560,2005-12-19
アニメ店長,2,島本和彦,一迅社,580,2005-09-24
新吼えろペン,2,島本和彦,小学館,560,2005-07-19
逆境ナイン,5,島本和彦,小学館,560,2005-06-17
逆境ナイン,6,島本和彦,小学館,560,2005-06-17
逆境ナイン,4,島本和彦,小学館,560,2005-05-19
逆境ナイン,3,島本和彦,小学館,560,2005-05-19
逆境ナイン,1,島本和彦,小学館,560,2005-04
逆境ナイン,2,島本和彦,小学館,560,2005-04
卓球社長,,島本和彦,小学館,550,2005-04
新吼えろペン,1,島本和彦,小学館,560,2005-03
吼えろペン,13,島本和彦,小学館,560,2004-12-17
吼えろペン,12,島本和彦,小学館,560,2004-07-16
吼えろペン,11,島本和彦,小学館,560,2004-07-16
ゲキトウ,1,島本和彦,講談社,540,2004-06-23
吼えろペン,10,島本和彦,小学館,560,2004-01-19
アニメ店長,1,島本和彦,スタジオディーエヌエー,580,2003-12-24
吼えろペン,9,島本和彦,小学館,560,2003-10-18
炎の転校生,2,島本和彦,小学館,630,2003-10
吼えろペン,8,島本和彦,小学館,560,2003-07-19
吼えろペン,7,島本和彦,小学館,560,2003-04-19
吼えろペン,6,島本和彦,小学館,560,2002-12-12
燃えよペン,,島本和彦,小学館,600,2002-11-19
吼えろペン,5,島本和彦,小学館,560,2002-07-18
吼えろペン,4,島本和彦,小学館,560,2002-04-19
吼えろペン,3,島本和彦,小学館,560,2001-12
吼えろペン,2,島本和彦,小学館,560,2001-09
吼えろペン,1,島本和彦,小学館,560,2001-08
怪奇カメムシ男,,島本和彦,エンターブレイン,819,2001-03
ハルマゲドン失敗す,,島本和彦,エンターブレイン,819,2001-03
コックローチマン,,島本和彦,エンターブレイン,819,2001-02
霊界トトカルチョ,,島本和彦,エンターブレイン,819,2001-02
炎の転校生,6,島本和彦,小学館,378,2000
燃えるV,3,島本和彦,小学館,378,2000
炎の転校生,4,島本和彦,小学館,378,2000
炎の転校生,1,島本和彦,小学館,378,2000
挑戦者,2,島本和彦,小学館,377,2000
炎の転校生,7,島本和彦,小学館,378,2000
炎の転校生,3,島本和彦,小学館,378,2000
炎の転校生,5,島本和彦,小学館,378,2000
炎の転校生,2,島本和彦,小学館,378,2000
炎の転校生,6,島本和彦,小学館,710,1999-08
レッド・カード―男の一枚,4,島本和彦,角川書店,630,1999-06
炎の転校生,5,島本和彦,小学館,710,1999-06
炎の転校生,4,島本和彦,小学館,710,1999-04
炎の転校生,3,島本和彦,小学館,710,1999-02
レッド・カード―男の一枚,3,島本和彦,角川書店,609,1999-01
炎の転校生,2,島本和彦,小学館,710,1998-12
炎の転校生,1,島本和彦,小学館,710,1998-10
炎の筆魂―島本和彦傑作選,2,島本和彦,朝日ソノラマ,840,1998-09
レッド・カード―男の一枚,2,島本和彦,角川書店,588,1998-04
レッド・カード―男の一枚,1,島本和彦,角川書店,567,1997-11
炎の筆魂―島本和彦傑作選,1,島本和彦,朝日ソノラマ,840,1997-10
炎の言霊―島本和彦名言集,,島本和彦,朝日ソノラマ,1155,1997-08
燃えるV,3,島本和彦,大都社,882,1997-07
燃えるV,2,島本和彦,大都社,882,1997-06
燃えるV,1,島本和彦,大都社,882,1997-06
オンセンマン,3,島本和彦,角川書店,588,1997-04
オンセンマン,2,島本和彦,角川書店,571,1996-08
流れ星のジャッカル,,島本和彦,メディアワークス,999,1996-04
オンセンマン,1,島本和彦,角川書店,567,1995-11
サムライスピリッツ,2,島本和彦,講談社,398,1995-04
サムライスピリッツ,1,島本和彦,講談社,398,1994-10
燃える女子プロレス,3,島本和彦,小学館,398,1994-02
燃える女子プロレス,2,島本和彦,小学館,398,1993-08
ここまでスポ魂,,島本和彦,宝島社,1009,1993-07
燃える女子プロレス,1,島本和彦,小学館,398,1993-04
炎のニンジャマン,4,島本和彦,小学館,398,1992-11
炎のニンジャマン,3,島本和彦,小学館,398,1992-10
炎の転校生,6,島本和彦,小学館,795,1992-09
炎のニンジャマン,2,島本和彦,小学館,398,1992-08
炎の転校生,5,島本和彦,小学館,795,1992-08
炎の転校生,4,島本和彦,小学館,795,1992-07
炎の転校生,3,島本和彦,小学館,795,1992-06
炎のニンジャマン,1,島本和彦,小学館,398,1992-06
炎の転校生,2,島本和彦,小学館,795,1992-05
炎の転校生,1,島本和彦,小学館,795,1992-04
燃えよペン,,島本和彦,竹書房,897,1991-08
炎の転校生,,島本和彦,扶桑社,704,1991-07
バトルサンダー,3,島本和彦,講談社,398,1991-07
バトルサンダー,2,島本和彦,講談社,398,1991-07
バトルサンダー,1,島本和彦,講談社,398,1991-07
挑戦者,4,島本和彦,小学館,398,1990-07
デスパイ―DEATH PIE,,島本和彦,竹書房,541,1990-07
BATTLEフィールド,1,島本和彦,小学館,509,1990-04
挑戦者,3,島本和彦,小学館,377,1990-03
挑戦者,1,島本和彦,小学館,378,1989-02
とつげきウルフ,3,島本和彦,小学館,378,1987-12
とつげきウルフ,2,島本和彦,小学館,378,1987-10
とつげきウルフ,1,島本和彦,小学館,378,1987-08
燃えるV,5,島本和彦,小学館,378,1987-02
燃えるV,4,島本和彦,小学館,378,1986-12
燃えるV,2,島本和彦,小学館,378,1986-08
燃えるV,1,島本和彦,小学館,378,1986-07
風の戦士ダン,9,島本和彦,小学館,378,1986-05
炎の転校生,12,島本和彦,小学館,399,1986-01
炎の転校生,11,島本和彦,小学館,378,1985-11
炎の転校生,10,島本和彦,小学館,378,1985-08
炎の転校生,9,島本和彦,小学館,378,1985-06
炎の転校生,8,島本和彦,小学館,378,1985-05
黒博物館スプリンガルド,,藤田和日郎,講談社,620,2007-09-21
邪眼は月輪に飛ぶ,,藤田和日郎,小学館,550,2007-04-27
からくりサーカス,43,藤田和日郎,小学館,410,2006-08-11
からくりサーカス,42,藤田和日郎,小学館,410,2006-05-18
暁の歌,,藤田和日郎,小学館,560,2006-05
夜の歌,,藤田和日郎,小学館,560,2006-04
からくりサーカス,41,藤田和日郎,小学館,410,2006-02-17
からくりサーカス,40,藤田和日郎,小学館,410,2005-12-15
からくりサーカス,39,藤田和日郎,小学館,410,2005-10-18
からくりサーカス,38,藤田和日郎,小学館,410,2005-07-15
からくりサーカス,37,藤田和日郎,小学館,410,2005-05-18
からくりサーカス,36,藤田和日郎,小学館,410,2005-02-18
からくりサーカス,35,藤田和日郎,小学館,410,2004-12-17
からくりサーカス,34,藤田和日郎,小学館,410,2004-10-18
からくりサーカス,33,藤田和日郎,小学館,410,2004-07-16
からくりサーカス,32,藤田和日郎,小学館,410,2004-05-18
からくりサーカス,31,藤田和日郎,小学館,410,2004-02-18
からくりサーカス,30,藤田和日郎,小学館,410,2003-11-18
からくりサーカス,29,藤田和日郎,小学館,410,2003-09-18
からくりサーカス,28,藤田和日郎,小学館,410,2003-06-18
からくりサーカス,27,藤田和日郎,小学館,410,2003-03-18
からくりサーカス,26,藤田和日郎,小学館,410,2003-01-18
からくりサーカス,25,藤田和日郎,小学館,410,2002-10-18
からくりサーカス,24,藤田和日郎,小学館,410,2002-08-09
からくりサーカス,23,藤田和日郎,小学館,410,2002-06-18
からくりサーカス,22,藤田和日郎,小学館,410,2002-04-18
からくりサーカス,21,藤田和日郎,小学館,410,2002-01
からくりサーカス,20,藤田和日郎,小学館,410,2001-11
からくりサーカス,19,藤田和日郎,小学館,410,2001-09
からくりサーカス,18,藤田和日郎,小学館,410,2001-06
からくりサーカス,17,藤田和日郎,小学館,410,2001-04
からくりサーカス,16,藤田和日郎,小学館,410,2001-01
からくりサーカス,15,藤田和日郎,小学館,410,2000-11
からくりサーカス,14,藤田和日郎,小学館,410,2000-09
からくりサーカス,13,藤田和日郎,小学館,410,2000-07
からくりサーカス,12,藤田和日郎,小学館,410,2000-05
からくりサーカス,11,藤田和日郎,小学館,410,2000-02
からくりサーカス,10,藤田和日郎,小学館,410,1999-12
からくりサーカス,9,藤田和日郎,小学館,410,1999-09
からくりサーカス,8,藤田和日郎,小学館,410,1999-06
からくりサーカス,7,藤田和日郎,小学館,410,1999-04
からくりサーカス,6,藤田和日郎,小学館,410,1999-02
からくりサーカス,5,藤田和日郎,小学館,410,1998-11
からくりサーカス,4,藤田和日郎,小学館,410,1998-09
からくりサーカス,3,藤田和日郎,小学館,410,1998-05
からくりサーカス,2,藤田和日郎,小学館,410,1998-02
からくりサーカス,1,藤田和日郎,小学館,410,1997-12
うしおととら (外伝),,藤田和日郎,小学館,410,1997-06
うしおととら,33,藤田和日郎,小学館,407,1997-01
うしおととら,32,藤田和日郎,小学館,407,1996-11
うしおととら,31,藤田和日郎,小学館,407,1996-10
うしおととら,30,藤田和日郎,小学館,407,1996-08
うしおととら,28,藤田和日郎,小学館,407,1996-04
うしおととら,29,藤田和日郎,小学館,407,1996-04
うしおととら,27,藤田和日郎,小学館,407,1996-01
うしおととら,26,藤田和日郎,小学館,407,1995-11
うしおととら,25,藤田和日郎,小学館,407,1995-09
うしおととら,24,藤田和日郎,小学館,398,1995-05
うしおととら,23,藤田和日郎,小学館,398,1995-03
うしおととら,22,藤田和日郎,小学館,398,1994-12
うしおととら,21,藤田和日郎,小学館,398,1994-09
うしおととら,20,藤田和日郎,小学館,398,1994-07
うしおととら,19,藤田和日郎,小学館,398,1994-06
うしおととら,18,藤田和日郎,小学館,398,1994-04
うしおととら,17,藤田和日郎,小学館,398,1993-11
うしおととら,16,藤田和日郎,小学館,398,1993-07
うしおととら,15,藤田和日郎,小学館,398,1993-05
うしおととら,14,藤田和日郎,小学館,398,1993-03
うしおととら,13,藤田和日郎,小学館,398,1992-12
うしおととら,12,藤田和日郎,小学館,398,1992-09
うしおととら,11,藤田和日郎,小学館,398,1992-07
うしおととら,10,藤田和日郎,小学館,398,1992-06
うしおととら,9,藤田和日郎,小学館,398,1992-03
うしおととら,8,藤田和日郎,小学館,398,1992-01
うしおととら,7,藤田和日郎,小学館,398,1991-11
うしおととら,6,藤田和日郎,小学館,398,1991-09
うしおととら,5,藤田和日郎,小学館,398,1991-08
うしおととら,4,藤田和日郎,小学館,398,1991-05
うしおととら,3,藤田和日郎,小学館,398,1991-03
うしおととら,2,藤田和日郎,小学館,398,1990-12
うしおととら,1,藤田和日郎,小学館,398,1990-11
";

			var db = new ComicDataContext(ConnectionString);
			db.DeleteDatabase();
			db.CreateDatabase();

			string[] lines = data.Split('\n');
			foreach (var line in lines)
			{
				string[] tokens = line.Split(',');
				if (tokens.Length != 6) continue;
				string title = tokens[0];
				int vol = 0;
				int.TryParse(tokens[1], out vol);
				string authorName = tokens[2];
				string publisherName = tokens[3];
				int price = 0;
				int.TryParse(tokens[4], out price);
				DateTime d;
				DateTime.TryParse(tokens[5], out d);
				DateTime? date = d.Ticks == 0 ? (DateTime?)null : d;

				var author = GetAuthor(db, authorName);
				var pub = GetPublisher(db, publisherName);
				var series = GetSeries(db, title, author, pub);
				var book = new Book()
				{
					Series = series,
					Volume = vol,
					ReleaseDate = date,
					Price = price,
				};
				db.Book.InsertOnSubmit(book);
				db.SubmitChanges();
			}

			SetAuthorInfo();
		}

		static void SetAuthorInfo()
		{
			var db = new ComicDataContext(ConnectionString);
			Author a;

			a = GetAuthor(db, "赤松健");
			a.Kana = "あかまつけん";
			a.Birthday = new DateTime(1968, 7, 5);
			a.Url = "http://www.ailove.net/main.html";
			db.SubmitChanges();

			a = GetAuthor(db, "久米田康治");
			a.Kana = "くめたこうじ";
			a.Birthday = new DateTime(1967, 9, 5);
			a.Url = "http://websunday.net/backstage/kumeta.html";
			db.SubmitChanges();

			a = GetAuthor(db, "藤田和日郎");
			a.Kana = "ふじたかずひろ";
			a.Birthday = new DateTime(1964, 5, 24);
			db.SubmitChanges();

			a = GetAuthor(db, "島本和彦");
			a.Kana = "しまもとかずひこ";
			a.Birthday = new DateTime(1961, 4, 26);
			a.Url = "http://simamoto.zenryokutei.com/";
			db.SubmitChanges();
		}

		public static Author GetAuthor(ComicDataContext db, string name)
		{
			var a = from x in db.Author where x.Name == name select x;
			if (a.Count() == 0)
			{
				var author = new Author()
				{
					Name = name
				};
				db.Author.InsertOnSubmit(author);
				db.SubmitChanges();
				return author;
			}
			return a.First();
		}

		public static Publisher GetPublisher(ComicDataContext db, string name)
		{
			var a = from x in db.Publisher where x.Name == name select x;
			if (a.Count() == 0)
			{
				var pub = new Publisher()
				{
					Name = name
				};
				db.Publisher.InsertOnSubmit(pub);
				db.SubmitChanges();
				return pub;
			}
			return a.First();
		}

		public static Series GetSeries(ComicDataContext db, string name, Author aut, Publisher pub)
		{
			var a = from x in db.Series where x.Name == name select x;
			if (a.Count() == 0)
			{
				var series = new Series()
				{
					Name = name,
					Author = aut,
					Publisher = pub,
				};
				db.Series.InsertOnSubmit(series);
				db.SubmitChanges();
				return series;
			}
			return a.First();
		}
	}
}
